Revit 2024 API
IndexStreamPoint Members
The IndexStreamPoint type exposes the following members.
Methods
Name | Description
AddPoint
 Inserts a IndexPoint into the stream and associated buffer.
AddPoints
 Inserts multiple IndexPoint instances into the stream and associated buffer.
Dispose |  (Inherited from IndexStream.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from IndexStream.)
See Also
IndexStreamPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace